# "Customer Purchase Propensity - Data Cleaning and Feature Engineering Pipeline"

In [1]:
import numpy as np
import seaborn as sns
import matplotlib.pyplot as mlt
import pandas as pd

In [2]:
df = pd.read_csv("customers.csv")
df

,customer_id,first_name,last_name,age,gender,income,city,signup_date
0,CUST1000,Calvin,Hill,56.0,Male,NaN,Hillville,2025-01-22
1,CUST1001,Diana,Hall,69.0,Other,82592.63,Lake Stephen,2024-07-26
2,CUST1002,Kimberly,Manning,46.0,Other,73442.20,New Jodifort,2026-02-05
3,CUST1003,Samantha,Drake,32.0,Male,58334.60,Nashburgh,2024-07-30
4,CUST1004,Kimberly,Sanchez,60.0,Female,81267.16,Lake Erikaburgh,2025-12-30
...,...,...,...,...,...,...,...,...
495,CUST1495,Andrew,Leonard,65.0,Male,86200.91,Christopherstad,2024-07-29
496,CUST1496,Mindy,Mueller,42.0,Male,59771.14,East Bradley,2026-01-17
497,CUST1497,Sarah,Eaton,57.0,Male,79648.16,West Kenneth,2023-08-28
498,CUST1498,Melissa,Stein,62.0,Female,70272.18,Jenniferview,2024-03-04
499,CUST1499,Daniel,Schultz,18.0,Other,56962.02,Snowton,2025-07-01

In [4]:
df.head()

,customer_id,first_name,last_name,age,gender,income,city,signup_date
0,CUST1000,Calvin,Hill,56.0,Male,NaN,Hillville,2025-01-22
1,CUST1001,Diana,Hall,69.0,Other,82592.63,Lake Stephen,2024-07-26
2,CUST1002,Kimberly,Manning,46.0,Other,73442.20,New Jodifort,2026-02-05
3,CUST1003,Samantha,Drake,32.0,Male,58334.60,Nashburgh,2024-07-30
4,CUST1004,Kimberly,Sanchez,60.0,Female,81267.16,Lake Erikaburgh,2025-12-30

In [5]:
df.tail()

,customer_id,first_name,last_name,age,gender,income,city,signup_date
495,CUST1495,Andrew,Leonard,65.0,Male,86200.91,Christopherstad,2024-07-29
496,CUST1496,Mindy,Mueller,42.0,Male,59771.14,East Bradley,2026-01-17
497,CUST1497,Sarah,Eaton,57.0,Male,79648.16,West Kenneth,2023-08-28
498,CUST1498,Melissa,Stein,62.0,Female,70272.18,Jenniferview,2024-03-04
499,CUST1499,Daniel,Schultz,18.0,Other,56962.02,Snowton,2025-07-01

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  500 non-null    object
 1   first_name   500 non-null    object
 2   last_name    500 non-null    object
 3   age          475 non-null    float64
 4   gender       500 non-null    object
 5   income       475 non-null    float64
 6   city         500 non-null    object
 7   signup_date  500 non-null    object
dtypes: float64(2), object(6)
memory usage: 31.4+ KB

In [7]:
df.describe()

              age        income
count  475.000000    475.000000
mean    44.115789  51445.303074
std     14.976256  15940.745251
min     18.000000   8230.470000
25%     32.000000  40557.925000
50%     45.000000  51176.130000
75%     56.000000  62305.465000
max     69.000000  97510.580000

In [8]:
df.isnull().sum()

customer_id     0
first_name      0
last_name       0
age            25
gender          0
income         25
city            0
signup_date     0
dtype: int64

In [11]:
df.shape

(500, 8)

In [9]:
df.columns

Index(['customer_id', 'first_name', 'last_name', 'age', 'gender', 'income',
       'city', 'signup_date'],
      dtype='object')

In [16]:
num_cols = df.select_dtypes(include=["float64","int"]).columns
cat_cols = df.select_dtypes(include=["object"]).columns

In [17]:
num_cols,cat_cols

(Index(['age', 'income'], dtype='object'),
 Index(['customer_id', 'first_name', 'last_name', 'gender', 'city',
        'signup_date'],
       dtype='object'))